## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
issue-verify.alpha.canada.ca.tf
```
```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_route53_record.deliverance-verification-alpha-canada-ca-NS` |
|        | `aws_route53_record.issue-verify-alpha-canada-ca-NS`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.deliverance-verification-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "deliverance-verification-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "deliverance-verification.alpha.canada.ca"
      + records         = [
          + "ns-1385.awsdns-45.org",
          + "ns-1965.awsdns-53.co.uk",
          + "ns-46.awsdns-05.com",
          + "ns-579.awsdns-08.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.issue-verify-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "issue-verify-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "issue-verify.alpha.canada.ca"
      + records         = [
          + "ns-1198.awsdns-21.org",
          + "ns-1946.awsdns-51.co.uk",
          + "ns-413.awsdns-51.com",
          + "ns-888.awsdns-47.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
